🧩 5 задач на закрепление

Ping Check

Напиши скрипт, который пингует 8.8.8.8 один раз и выводит “OK”, если код возврата = 0.

Проверка сервиса

Выполни systemctl is-active sshd.
Если вывод "active" — напечатай "Сервис работает", иначе "Сервис неактивен".

Кто запустил скрипт

Получи имя текущего пользователя через whoami и выведи его.

Мониторинг места

Получи результат df -h / и выведи только строку, где есть /dev/.

Git auto-update

Выполни git pull, и если код возврата ≠ 0 — выведи "Ошибка обновления".
